import 'package:expansion_tile_card/expansion_tile_card.dart';
import 'package:flutter/material.dart';
import 'package:islami_app/componants/componants.dart';
import 'package:islami_app/styles/color_manager.dart';

class AllahNames extends StatelessWidget {
  const AllahNames({super.key});


  static List<String> allahNames=[
    'الله',
    'الرَّحْمن',
    'الرَّحِيم',
    'المَلِك',
    'الْقُدُّوس',
    'السَّلَام',
    "المُؤْمِن",
    "الْمُهَيْمِن",
    "الْعَزِيز",
    "الْجَبَّار",
    "الْمُتَكَبِّر",
    "الْخَالِق",
    " الْبَارِئ",
    "الْمُصَوِّر",
    "اَلْغَفَّار",
    "الْقَهَّار",
    "الْوَهَّاب",
    "الرَّزَّاق",
    "الْفَتَّاح",
    "الْعَلِيم",
    "الْقَابِض",
    "الْبَاسِط",
    "الخافض",
    "الرَّافِع",
    "المُعز",
    "المُذل",
    "السَّمِيع",
    "الْبَصِير",
    "الْحَكَم",
    "العدل"
        "اللَّطِيف",
    "الْخَبِير",
    "الْحَلِيم",
    "الْعَظِيم",
    "الْغَفُور",
    "الشَّكُور",
    "الْعَلِي",
    "الْكَبِير",
    "الْحَفِيظ",
    "المُقِيت",
    "الْحَسِيب",
    "الجليل",
    "الْكَرِيم",
    "الرَّقِيب",
    "الْمُجِيب",
    "الْوَاسِع",
    "اَلْحَكِيم",
    "الْوَدُود",
    "الْمَجِيد",
    "الباعث",
    "الشَّهِيد",
    "الْحَق",
    "الْوَكِيل",
    "الْقَوِي",
    "الْمَتِين",
    "الْوَلِي",
    "الْحَمِيد",
    "الْـمُحْصِي",
    "المبدئ",
    "المعيد",
    "المُحيي",
    " المميت"
        "الْحَي",
    "الْقَيُّوم",
    "الواجد",
    "الماجد",
    "الْوَاحِد",
    "الصَّمَد",
    "الْقَادِر",
    "الْمُقْتَدِر",
    "الْمُقَدِّم",
    "الْمُؤَخِّر",
    "الْأَوَّل",
    "الْآخِر",
    "الظَّاهِر",
    "الْبَاطِن",
    "الوالي",
    "الْمُتَعَال",
    "الْبَر",
    "التَّوَّاب",
    "الْمُنْتَقِم",
    "العَفُو",
    "الرَّؤُوف",
    "مَالِكُ الْمُلْك",
    "ذُو الْجَلَالِ والْإكْرَام",
    "المقسط",
    "الْجَامِع",
    "الْغَنِي",
    "المغني",
    "الْمُعْطِي",
    "المانع",
    "الضار",
    "النافع",
    "النُّور",
    "الْهَادِي",
    "الْبَدِيع",
    "الباقي",
    "الْوَارِث",
    "الرشيد",
    " الصبور",
  ];



  static List<String> allahNamesDetails = [
  "عَلَمٌ على الذات الإلهية، الاسم الأعظم الذي تفرد به الحق سبحانه.",
  "كثير الرحمة، اسم مقصور عليه فلا يقال لغيره، يرحم بجلائل النعم.",
  "المنعم أبدًا، المتفضل دومًا، فرحمته لا تنتهي، يرحم بدقائق النّعم.",
  "ملك الملوك، له الملك، مالك يوم الدين، مليك الخلق، فهو المالك المطلق.",
  "الطاهر المنزه عن العيوب والنقائص، وعن كل ما تحيط به العقول.",
  "ناشر السلام بين الأنام، سلمت ذاته من النقص والعيب والفناء.",
  "سلَّم أوليائه من عذابه، ويُصدق عباده ما وعدهم.",
  "الحافظ لكل شيء، القائم على خلقه، والمطلع على خفايا الأمور، وخبايا الصدور.",
  "المنفرد بالعزة، الظاهر الذي لا يُقهر، القوي الممتنع غالب كل شيء.",
  "تنفذ مشيئته، ولا يخرج أحد عن تقديره، القاهر لخلقه على ما أراد.",
  "المتعالي عن صفات الخلق، المنفرد بالعظمة والكبرياء.",
  "المبدع لكل شيء والمُقدّر له، الموجد للأشياء من العدم، خالق كل صانع وصنعته.",
  "خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود.",
  "أعطى كل موجود صورة خاصة تمّيزه، وهيئة منفردة، على اختلاف الموجودات وكثرتها.",
  "يغفر الذنوب ويستر العيوب في الدنيا والآخرة.",
  "الغالب الذي قهر خلقه بسلطانه وقدرته، وخضعت له الرقاب، وذلت له الجبابرة، وصرف خلقه على ما أراد طوعًا وكرهًا، وعنت الوجوه له.",
  "المنعم على العباد، يهب بغير عوض، ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء.",
  "خلق الأرزاق، وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته.",
  "يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض.",
  "يعلم تفاصيل الأمور، ودقائق الأشياء، وخفايا الضمائر، والنفوس، لا يعزب عنه مثقال ذرة، فعلمه يحيط بجميع الأشياء.",
  "  ُ  يقبض الرزق عمن يشاء من الخلق بعدله وحكمته.ُ",
  "يوسّعُ الرزق لمن يشاء من عباده بجوده ورحمته.",
  "يخفض كل من طغى وتجبر وخرج على شريعته وتمرّد.",
  "ُيرفع عباده المؤمنين بالطاعات، ويرفعهم على عدوهم فينصرهم، وهو رافع السماوات السبع",
      ".ّ  يهب القوة والغلبة والشدة لمن شاء فيعزه.",
  "ّ  ينزع القوة والغلبة والشّدة عمن يشاء فيذله",
   "   .ُ  سمعه لجميع الأصوات الظاهرة والباطنة الخفية والجلية، وإحاطته التامة بها، وسمع السائلين والداعين والعابدين، ويجيبهم ويثيبهم"
      ".يرى الأشياء كلها ظاهرها وباطنها، المحيط بكل شيء علمًا.",
  "يفصل بين مخلوقاته بما شاء، ويفصل بين الحق والباطل، لا راد لقضائه، ولا معقب لحكمه."
  "حرَّم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله، يعطي كل ذي حق حقه."
  "ُ  الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم.",
"  ُ  العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء، العالم بما كان ويكون.",
  "ُ  يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع.",
  "ُ  العظيم في كل شيء، عظيم في ذاته وأسمائه وصفاته، فلا أحد يساويه، ولا عظيم يدانيه.",
  "ُ  الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم، الفرق بين هذا الاسم واسم الغفار  أنّ اسم الغفور يكون للدلالة على مغفرة الذنب مهما عظم وأيس صاحبه من المغفرة، أمّا الغفار فتدل على مغفرة الله المستمرة للذنوب المختلفة لأن الإنسان خطاء فالله غفار.",
  "ُ  يزكو عنده القليل من أعمال العباد، فيتقبلها ويضاعف أجرها.",
  "ُّ  الرفيع القدر فلا يحيط به وصف الواصفين، المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتًا وقهرًا وشأنًا. "
 " ُ  العظيم الجليل ذو الكبرياء في صفاته وأفعاله، فلا يحتاج إلى شيء، ولا يعجزه شيء.",
  "ُ  لا يغرب عن حفظه شيء ولو كمثقال الذر، فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل.",
  "المتكفل بإيصال أقوات الخلق إليهم، وهو الحفيظ والمقتدر والقدير والمقدر والممدد.",
  "ُ  الكافي الذي منه كفاية العباد، عليه الاعتماد يكفي العباد بفضله.",
  "العظيم المطلق المتصف بجميع صفات الكمال، والمنعوت بكمالها، المنزه عن كل نقص.",
  "ُ  الكثير الخير، الجواد المعطي الذي لا ينفد عطاؤه، وهو الكريم المطلق، الجامع لأنواع الخير والشرف والفضائل، المحمود بفعاله.",
  "ُ  يراقب أحوال العباد، ويعلم أقوالهم، ويحصي أعمالهم، وهو الحافظ الذي لا يغيب عنه شيء.",
  "ُ  يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يُسأل أحد سواه.",
  "ُ  وسع رزقه جميع خلقه، وسعت رحمته كل شيء، المحيط بكل شيء.",
  "ُ  المُحق في تدبيره، اللطيف في تقديره، الخبير بحقائق الأمور، العليم بحكمه المقدور في جميع خلقه، وقضاءه خير وحكمه وعدل.",
  "ُ  المحب لعباده، والمحبوب في قلوب أوليائه.",
  "ُ  تمجَّد بفعاله، ومجَّده خلقه لعظمته، والمجيد هو واسع الكرم، ووصف نفسه بالمجيد وهو متضمن كثرة صفات كماله وسعتها، وعدم إحصاء الخلق لها، وسعة أفعاله وكثرة خيره ودوامه، وتعني أيضاً البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر.",
  "باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد.",
  "ُ  الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله.",
  "ُّ  يحق الحق بكلماته، ويؤيد أولياءه، فهو المستحق للعبادة."
  "ُ  الكفيل بالخلق القائم بأمورهم، فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه.",
  "ّ  صاحب القدرة التامة البالغة الكمال، غالب لا يُغلب فقوته فوق كل قوة، ولا يرد قضاءه راد، ينفذ أمره، ويمضي قضاؤه في خلقه، شديد عقابه لمن كفر بآياته وجحد حججه.",
  "ُ  الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا معين، فهو المتناهي في القوة، لا تلحق أفعاله مشقة، ولا يمسه فيها لغوب.",
  "ُّ  المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي لأمور الخلائق.",
  "ُ  المستحق للحمد والثناء؛ على ذاته وصفاته وعلى نعمه التي لا تحصى."
  "أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل.",
  "أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال."
  "يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة.",
  "خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت.",
  "مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء.",
  "ُّ  المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية، الباقي أزلًا وأبدًا، الحيّ الذي لا يموت.",
  "ُ  القائم بنفسه، الغني عن غيره، القائم بتدبير أمر خلقه في إنشائهم ورزقهم.",
  "لا يعوزه شيء ولا يعجزه شيء، يجد كل ما يطلبه، ويدرك كل ما يريده.",
  "له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال، يعامل العباد بالجود.",
  "ُ  الفرد المتفرد في ذاته وصفاته وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه.",
  "ُ  المطاع لا يقضى دونه أمر، يُقصد إليه في الحوائج، مقصد عباده في مهمات دينهم ودنياهم.",
  "ُ  يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدًا عليه ولا ناقصًا عنه.",
  "ُ  يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره.",
  "ُ  يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه.",
  "ُ  يؤخر الأشياء فيضعها في مواضعها، المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير.",
  "ُ  لم يسبقه في الوجود شيء، فهو أول قبل الوجود."
  "ُ  الباقي بعد فناء خلقه، البقاء الأبدي، يفنى الكل وله البقاء وحده، فليس بعده شيء.",
  "ُ  ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله.",
  "ُ  العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد.",
  "المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه.",
  "ِ  جلّ عن إفك المفترين، وتنزه عن وساوس المتحيرين.",
  "ُّ  العطوف على عباده ببره ولطفه، مَنَّ على السائلين بحسن عطائه، وصدقهم فيما وعد.",
  "ُ  يوفق عباده للتوبة حتى يتوب عليهم، ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بالغفران.",
  "ُ  يقصم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار.",
  "يترك المؤاخذة على الذنوب ولا يذكرك بالعيوب، فهو يمحو السيئات ويتجاوز عن المعاصي.",
  "ُ  المتعطف على المذنبين بالتوبة، جادَ بلطفه ومَنّ بتعطفه، يستر العيوب ثم يعفو عنها.",
  "ِ  المتصرف في ملكه كيف يشاء لا رادّ لحكمه، ولا معقب لأمره.",
  "ِ  المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يُجلّ.",
  "العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم.",
  "ُ  جمع الكمالات كلها، ذاتًا ووصفًا وفعلًا، يجمع بين الخلائق المتماثلة والمتباينة، ويجمع الأولين والآخرين."
  "ُّ  لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه.",
  "معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده.",
  "أعطى كل شيء.",
  "يمنع العطاء عمّن يشاء ابتلاءً أو حماية.",
  "ّ  المقدر للضّر على من أراد كيف أراد.",
  "المقدر النفع والخير لمن أراد كيف أراد.",
  "ُ  الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره.",
  "المبين للخلق طريق الحق بكلامه، يهدي القلوب إلى معرفته، والنفوس إلى طاعته.",
  "ُ  لا يماثله أحد في صفاته، ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال.",
  "وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء.",
  "ُ  الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها.",
  "أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد.",
  " الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر، ولا يسرع بالفعل قبل أوانه.",
  ];


  @override
  Widget build(BuildContext context) {
    return  Scaffold(
        appBar: defaultAppBar(
            context: context,
            title: 'اسماء الله الحسنه و شرحها'
        ),

        body: Container(
            padding: EdgeInsets.symmetric(
              horizontal: MediaQuery.of(context).size.height*.02,
              vertical: MediaQuery.of(context).size.height*.02,
            ),
            child: ListView.separated(
                itemBuilder: (context,index){
                  return Container(
                    clipBehavior: Clip.antiAliasWithSaveLayer,
                    decoration: BoxDecoration(
                      color: ColorManager.darkGrey.withOpacity(.5),
                      borderRadius: BorderRadius.circular(12),
                    ),
                    child: ExpansionTileCard(
                      expandedColor: ColorManager.lightColor2,
                      baseColor: ColorManager.lightColor2,
                      title: Text(allahNames[index],style: Theme.of(context).textTheme.headlineSmall!.copyWith(
                        color: ColorManager.black,
                      ),),
                      children: <Widget>[
                        const Divider(
                          thickness: 1.0,
                          height: 1.0,
                        ),
                        Align(
                          alignment: Alignment.centerLeft,
                          child: Padding(
                            padding: const EdgeInsets.symmetric(
                              horizontal: 16.0,
                              vertical: 8.0,
                            ),
                            child: Text(
                              allahNamesDetails[index],
                              style: Theme.of(context).textTheme.headlineMedium!.copyWith(
                                  fontSize: MediaQuery.of(context).size.height*.03,
                                  color: ColorManager.black
                              ),
                            ),
                          ),
                        ),

                      ],
                    ),
                  );

                },
                separatorBuilder: (context,index){
                  return SizedBox(height: MediaQuery.of(context).size.height*.02,);
                },
                itemCount: allahNamesDetails.length
            ))
    );
  }
}
